app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
    product = Product.find(params[:id])

INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-10-03 13:53:25', 1, 3, 1, 87.0, '2010-10-03 13:53:25')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('liu', 'fdsakjfsdalj', '2010-10-03 13:53:25', '2010-10-03 13:53:25', 'check', 'l@asdlfj.com')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save